Revit 2027 API
FabricationServiceButton.IsAHanger Property
 Checks if the fabrication service button is hanger.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAHanger { get; }
Public ReadOnly Property IsAHanger As Boolean
	Get
public:
property bool IsAHanger {
	bool get ();
}
member IsAHanger : bool with get
Property Value
Boolean
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace